ale87jan/Librerias-MCXA156/Ejemplos/flexio_mculcd/source/pin_mux.c
    const port_pin_config_t port2_1_pin23_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    .driveStrength1 = kPORT_NormalDriveStrength,
                                                    /* Pin is configured as FLEXIO0_D9 */
                                                    .mux = kPORT_MuxAlt6,
                                                    /* Digital input enabled */
                                                    .inputBuffer = kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    .invertInput = kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = kPORT_UnlockRegister};
    /* PORT2_1 (pin 23) is configured as FLEXIO0_D9 */
    PORT_SetPinConfig(PORT2, 1U, &port2_1_pin23_config);

    const port_pin_config_t LCD_INT = {/* Internal pull-up resistor is enabled */
                                       .pullSelect = kPORT_PullUp,
                                       /* Low internal pull resistor value is selected. */
                                       .pullValueSelect = kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       .slewRate = kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       .openDrainEnable = kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       .driveStrength = kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       .driveStrength1 = kPORT_NormalDriveStrength,
                                       /* Pin is configured as P2_15 */
                                       .mux = kPORT_MuxAlt0,
                                       /* Digital input enabled */
                                       .inputBuffer = kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                       .invertInput = kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       .lockRegister = kPORT_UnlockRegister};
    /* PORT2_15 (pin 36) is configured as P2_15 */
    PORT_SetPinConfig(BOARD_INITPINS_LCD_INT_PORT, BOARD_INITPINS_LCD_INT_PIN, &LCD_INT);

    const port_pin_config_t LCD_DC = {/* Internal pull-up/down resistor is disabled */
                                      .pullSelect = kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = kPORT_NormalDriveStrength,
                                      /* Pin is configured as P2_17 */
                                      .mux = kPORT_MuxAlt0,
                                      /* Digital input enabled */
                                      .inputBuffer = kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      .invertInput = kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = kPORT_UnlockRegister};
    /* PORT2_17 (pin 38) is configured as P2_17 */
    PORT_SetPinConfig(BOARD_INITPINS_LCD_DC_PORT, BOARD_INITPINS_LCD_DC_PIN, &LCD_DC);

    const port_pin_config_t LCD_CS = {/* Internal pull-up/down resistor is disabled */
                                      .pullSelect = kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = kPORT_NormalDriveStrength,
                                      /* Pin is configured as P2_19 */
                                      .mux = kPORT_MuxAlt0,
                                      /* Digital input enabled */
                                      .inputBuffer = kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      .invertInput = kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = kPORT_UnlockRegister};
    /* PORT2_19 (pin 39) is configured as P2_19 */
    PORT_SetPinConfig(BOARD_INITPINS_LCD_CS_PORT, BOARD_INITPINS_LCD_CS_PIN, &LCD_CS);

    const port_pin_config_t LCD_RD = {/* Internal pull-up resistor is enabled */
                                      .pullSelect = kPORT_PullUp,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = kPORT_NormalDriveStrength,
                                      /* Pin is configured as FLEXIO0_D28 */
                                      .mux = kPORT_MuxAlt6,
                                      /* Digital input enabled */
                                      .inputBuffer = kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      .invertInput = kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = kPORT_UnlockRegister};
    /* PORT2_20 (pin 40) is configured as FLEXIO0_D28 */
    PORT_SetPinConfig(BOARD_INITPINS_LCD_RD_PORT, BOARD_INITPINS_LCD_RD_PIN, &LCD_RD);

    const port_pin_config_t LCD_TE = {/* Internal pull-up resistor is enabled */
                                      .pullSelect = kPORT_PullUp,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = kPORT_NormalDriveStrength,
                                      /* Pin is configured as P2_21 */
                                      .mux = kPORT_MuxAlt0,
                                      /* Digital input enabled */
                                      .inputBuffer = kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      .invertInput = kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = kPORT_UnlockRegister};
    /* PORT2_21 (pin 41) is configured as P2_21 */
    PORT_SetPinConfig(BOARD_INITPINS_LCD_TE_PORT, BOARD_INITPINS_LCD_TE_PIN, &LCD_TE);

    const port_pin_config_t LCD_WR = {/* Internal pull-up resistor is enabled */
                                      .pullSelect = kPORT_PullUp,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = kPORT_NormalDriveStrength,
                                      /* Pin is configured as FLEXIO0_D31 */
                                      .mux = kPORT_MuxAlt6,
                                      /* Digital input enabled */
                                      .inputBuffer = kPORT_InputBufferEnable,
                                      /* Digital input is not inverted */
                                      .invertInput = kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = kPORT_UnlockRegister};
    /* PORT2_23 (pin 42) is configured as FLEXIO0_D31 */
    PORT_SetPinConfig(BOARD_INITPINS_LCD_WR_PORT, BOARD_INITPINS_LCD_WR_PIN, &LCD_WR);

    const port_pin_config_t LCD_RST = {/* Internal pull-up/down resistor is disabled */
                                       .pullSelect = kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       .pullValueSelect = kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       .slewRate = kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       .openDrainEnable = kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       .driveStrength = kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       .driveStrength1 = kPORT_NormalDriveStrength,
                                       /* Pin is configured as P3_0 */
                                       .mux = kPORT_MuxAlt0,
                                       /* Digital input enabled */
                                       .inputBuffer = kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                       .invertInput = kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       .lockRegister = kPORT_UnlockRegister};
    /* PORT3_0 (pin 73) is configured as P3_0 */
    PORT_SetPinConfig(BOARD_INITPINS_LCD_RST_PORT, BOARD_INITPINS_LCD_RST_PIN, &LCD_RST);

    const port_pin_config_t LCD_BLK = {/* Internal pull-up/down resistor is disabled */
                                       .pullSelect = kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       .pullValueSelect = kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       .slewRate = kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       .openDrainEnable = kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       .driveStrength = kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       .driveStrength1 = kPORT_NormalDriveStrength,
                                       /* Pin is configured as P3_22 */
                                       .mux = kPORT_MuxAlt0,
                                       /* Digital input enabled */
                                       .inputBuffer = kPORT_InputBufferEnable,
                                       /* Digital input is not inverted */
                                       .invertInput = kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       .lockRegister = kPORT_UnlockRegister};
    /* PORT3_22 (pin 53) is configured as P3_22 */
    PORT_SetPinConfig(BOARD_INITPINS_LCD_BLK_PORT, BOARD_INITPINS_LCD_BLK_PIN, &LCD_BLK);

